### Importing Libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("occupation_data.csv", sep="|", index_col="user_id")

In [3]:
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [4]:
df.shape

(943, 4)

### Create My Own DataFrame

In [5]:
occupation = {
    "age": [35, 50, 45, 72, 48, 26, 41],
    "gender": ["Male", "Female", "Male", "Male", "Female", "Male", "Female"],
    "job_title": ["Data Analyst", "Front-End Developer", "student", "student", "writer", 
                  "Back-End Developer", "AI Engineering"],
    "zip_code": ["15213", "77841", "43537", "43537", "94043", "33319", "02138"]
}

In [6]:
new_df = pd.DataFrame(occupation)

In [7]:
new_df

   age  gender            job_title zip_code
0   35    Male         Data Analyst    15213
1   50  Female  Front-End Developer    77841
2   45    Male              student    43537
3   72    Male              student    43537
4   48  Female               writer    94043
5   26    Male   Back-End Developer    33319
6   41  Female       AI Engineering    02138

### Solve The Problem of the Index of New DataFrame!!

Craet a Range of ids Starts From The Last Index_record in the original Data

In [8]:
ids = np.arange(df.shape[0] + 1,(df.shape[0] + 1) +(new_df.shape[0]))
ids

array([944, 945, 946, 947, 948, 949, 950])

In [9]:
new_df.set_index(ids, inplace=True)

In [10]:
new_df

     age  gender            job_title zip_code
944   35    Male         Data Analyst    15213
945   50  Female  Front-End Developer    77841
946   45    Male              student    43537
947   72    Male              student    43537
948   48  Female               writer    94043
949   26    Male   Back-End Developer    33319
950   41  Female       AI Engineering    02138

### Save The New Data In Existing CSV File

In [11]:
new_df.to_csv("occupation_data.csv" , mode="a", sep="|", header=False)

### Read File Again To Notice The Shape

In [12]:
pd.read_csv("occupation_data.csv", sep='|', index_col="user_id")

         age  gender          occupation zip_code
user_id
1         24       M          technician    85711
2         53       F               other    94043
3         23       M              writer    32067
4         24       M          technician    43537
5         33       F               other    15213
...      ...     ...                 ...      ...
946       45    Male             student    43537
947       72    Male             student    43537
948       48  Female              writer    94043
949       26    Male  Back-End Developer    33319
950       41  Female      AI Engineering    02138

[950 rows x 4 columns]